/* 1. Умовні конструкції: 
Написати код, який буде:
Запитати в користувача його вік:
Якщо вік більший 7 і менший 17
	Запитати в користувача ім’я
		Якщо ввів:
			Вивести “Доброго дня, <name>”
		Інакше вивести “До побачення”
Інакше вивести “Ви народились не в 2000х”*/
 var a=prompt("How old are you?", 7);
 if (a >7 && a <17) {
	 var b=prompt ("What is your name?");
 }
 else {
	 alert ("You was borned not in 2000th");
 } 
 if (b!=null) {
	 alert ("Доброго дня, "+b);
 }
 else {
	 alert ("Goodbye!");
 }
/*4. Переписати while у for
Вказати, що виведе останній alert*/
var x=2;
f=x*x;
for (n=5; n>2; n--){
	f=f*x;
}
alert (f);//взяла while ,який написала для завдання №6
/*5. Без запуску, що виведеться? (тут була картинка). В першому виклику функції, думаю, алерт виведе Andrii, оскільки ця перемінна в глобальній
області видимості, а в другому виклику виведе Ivan */
/*6. Напишіть функцію min (a, b), яка повертає більше чисел a, b.
min(1,2)//2
min(23, 3)//23
Напишіть рекурсивну функцію pow (x, n), яка повертає x в ступені n. Інакше кажучи, примножує x на себе n разів і повертає результат.
pow(2,2); 2*2 = 4;
pow(2, 5); 2*2*2*2*2 = 32;
*/
function min (a,b) {
if (a>b) {
console.log(a);
}
else if (a<b) {
console.log(b);
}
 }
function minarr (arr=['a','b']) { //варіант з масивом
if (arr[0]>arr[1]) {
return(arr[0]);
}
else if (arr[0]<arr[1]) {
return(arr[1]);
}
 }
 function pow (x,n) {
	f=x*x;
	while (n>2) {
	n--;	
    f=f*x;	
} 
return f;
}






 
 